Feature: Изтриване на топик

  Scenario Outline: 
    Given Натиснем бутона за опции на топик
    When Топик притежава id: "<topicId>"
    And Текущ потребител id - топик: "<currentUserId>"
    And Проверка дали има разрешение и реализиране на изтриването на топик
    Then Виждаме съобщение за изтриване на топик: "<expectedDeleteMessage>"

    #user1 is admin
		#user2 is not admin, owner of the comment1 and comment2
		#user3 is not admin, owner of the topic1 and topic2
    Examples: 
      | topicId   | currentUserId |  expectedDeleteMessage                        				|      
   	  | 1           | 1             |  Топикът е изтрит от администратор.		       		    |        
      | 1           | 3             |  Топикът е изтрит от собственик.                    |
      | 1           | 2             |  Потребителят няма разрешение да изтрие топика!     | 
      | 1           | 4             |  Потребител с даденото id не съществува!            |
      | 99          | 99            |  Потребител и топик с дадените id-та не съществува! |       
      | 3           | 2             |  Топик с даденото id не съществува!                 |
      | -1          | 1             |  Невалиден id на топик!                             | 
      |             | 1             |  Невалиден id на топик!                             | 
      | qwe         | 1             |  Невалиден id на топик!                             |
      | 1           | -1            |  Невалиден id на потребител!     								 	  |                           
      | 1           |               |  Невалиден id на потребител!   										  |
      | 1           | qwe           |  Невалиден id на потребител!      						      | 
      | -23         | qwe           |  Невалидни id-та на потребител и топик!             | 
      
 
