
Feature: Изтриване на коментар

  Scenario Outline: 
    Given Натиснем бутона за опции на коментар
    When Коментарът притежава id: "<commentId>"
    And Текущ потребител id - коментар: "<currentUserId>"
    And Проверка дали има разрешение и реализиране на изтриването на коментар
    Then Виждаме съобщение за изтриване на коментар: "<expectedDeleteMessage>"
    
    #user1 is admin
		#user2 is not admin, owner of the comment1 and comment2
		#user3 is not admin, owner of the topic1 and topic2
    Examples: 
      | commentId   | currentUserId |  expectedDeleteMessage                        				|      
   	  | 1           | 1             |  Коментарът е изтрит от администратор.		       		  |        
      | 1           | 2             |  Коментарът е изтрит от собственик.                   |
      | 1           | 3             |  Потребителят няма разрешение да изтрие коментара!    | 
      | 1           | 4             |  Потребител с даденото id не съществува!              |
      | 99          | 99            |  Потребител и коментар с дадените id-та не съществува!|       
      | 3           | 2             |  Коментар с даденото id не съществува!                |
      | -1          | 1             |  Невалиден id на коментар!                            | 
      |             | 1             |  Невалиден id на коментар!                            | 
      | qwe         | 1             |  Невалиден id на коментар!                            |
      | 1           | -1            |  Невалиден id на потребител!     											|                           
      | 1           |               |  Невалиден id на потребител!   											  |
      | 1           | qwe           |  Невалиден id на потребител!      						        | 
      | -23         | qwe           |  Невалидни id-та на потребител и коментар!            | 
      
 
